---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SweepFailures.ComplexPathWithComplexProfile
source: html/776f4b6b-b075-a918-f957-f43584c1bbe5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SweepFailures.ComplexPathWithComplexProfile Property

Sweep cannot have a path with ellipse or spline segments and a profile with non-straight lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId ComplexPathWithComplexProfile { get; }
```